# Есть n (вопрос) чисел. 
# Найти кол-во елементов какие соответствуют следующим параметрам:

# 1. Если число делиться на 5 без остатка;
# 2. При делении на 7 дает остаток 1, или 2, или 5;
# 3. Если не парное число и отрицательное;
# 4. Найти сумму елементов, которые деляться на 5 без остатка;
# 5. Найти результат умножения положительных елементов;
# 6. Найти наибольший (наименьший) элемент и его порядковый номер;
# 7. Все отрицательные елементы умножить на 2;
# 8. А все положительные – уменьшить на 1